<?php
/**
 * Created by PhpStorm.
 * User: jianguog
 * Date: 16/6/1
 * Time: 07:51
 */

$country_state_city = array(
    '美国' => array('华盛顿州'=>'西雅图', '犹他州'=>'盐湖城'),
);

$country_city = array(
    '美国' => array('西雅图','拉斯维加斯','纽约','洛杉矶','夏威夷','旧金山','圣地亚哥','芝加哥','华盛顿','奥兰多','波士顿','圣保罗'),
    '中国' => array('北京','上海','杭州','广州','深圳','厦门','南京','成都','青岛','武汉','西安','天津','重庆','苏州','济南','长沙','香港','大连','三亚','哈尔滨'),
);

$region_phone_country = array(
    '热门' => array('+86'=>'中国大陆','+1'=>'美国'),
    '欧洲' => array('+353'=>'爱尔兰','+43'=>'奥地利', '+32'=>'比利时','+48'=>'波兰','+354'=>'冰岛','+45'=>'丹麦','+49'=>'德国',
        '+7'=>'俄罗斯','+33'=>'法国','+358'=>'芬兰','+379'=>'梵蒂冈','+31'=>'荷兰','+420'=>'捷克','+423'=>'列支敦士登','+370'=>'立陶宛',
        '+352'=>'卢森堡','+40'=>'罗马尼亚','+377'=>'摩纳哥','+47'=>'挪威','+351'=>'葡萄牙','+46'=>'瑞典','+41'=>'瑞士','+421'=>'斯洛伐克',
        '+90'=>'土耳其','+380'=>'乌克兰', '+34'=>'西班牙','+30'=>'希腊','+44'=>'英国','+39'=>'意大利'),
    '亚洲' => array('+971'=>'阿联酋','+975'=>'不丹','+63'=>'菲律宾','+82'=>'韩国','+855'=>'柬埔寨','+960'=>'马尔代夫','+880'=>'孟加拉国',
        '+60'=>'马来西亚','+81'=>'日本','+853'=>'澳门特别行政区', '+966'=>'沙特阿拉伯','+66'=>'泰国','+886'=>'台湾','+673'=>'文莱',
        '+852'=>'香港特别行政区','+65'=>'新加坡','+91'=>'印度','+62'=>'印尼','+84'=>'越南','+972'=>'以色列'),
    '大洋洲' => array('+61'=>'澳大利亚','+64'=>'新西兰'),
    '非洲' => array('+20'=>'埃及','+248'=>'塞舌尔'),
    '美洲' => array('+55'=>'巴西','+52'=>'墨西哥', '+1'=>'加拿大'),
);

function getDescByPhoneCode ($region_phone_country, $code) {
    if(isset($code)){
        foreach ($region_phone_country as $region => $phone_country) {
            if (isset($phone_country[$code])){
                return $phone_country[$code]." ".$code;
            }
        }
    } else {
        return "中国大陆 +86";
    }
}

function getPhoneCodeByPhoneCode ($code) {
    return isset($code) ? $code : "+86" ;
}

?>